# Handling  date and time

In [ ]:
Handling **Date & Time in Feature Engineering** is extremely important in ML because raw timestamps are almost never useful directly.

If you give a model:

```
2026-02-20 14:35:22
```

The model sees it as just a number/string.
But **time contains patterns** ‚Äî seasonality, trends, cycles, human behavior.

Let‚Äôs break this deeply in a structured playbook üëá

---

# üî• COMPLETE PLAYBOOK: Handling Date & Time in Feature Engineering

---

# 1Ô∏è‚É£ Step 1: Convert to Proper Datetime Type

In pandas:
 
```python
df['date'] = pd.to_datetime(df['date'])
```

Why?

* Enables extraction
* Enables time difference
* Enables sorting
* Enables resampling

---

# 2Ô∏è‚É£ Step 2: Extract Useful Components

Raw datetime is useless.
Break it into **informative parts**.

### Common Features

| Feature      | Why useful            |
| ------------ | --------------------- |
| Year         | Long-term trend       |
| Month        | Seasonality           |
| Day          | Daily patterns        |
| Day of week  | Weekend vs weekday    |
| Hour         | Human activity cycles |
| Quarter      | Business cycles       |
| Week of year | Seasonal effects      |

### Example:

```python
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day
df['day_of_week'] = df['date'].dt.dayofweek
df['hour'] = df['date'].dt.hour
```

---

# 3Ô∏è‚É£ Cyclical Encoding (VERY IMPORTANT)

‚ö†Ô∏è Huge mistake people make:
Treating month or hour as linear.

Example:

* Hour 23 and Hour 0 are close
* But numerically 23 and 0 are far

So we encode cyclically using sin/cos.

### Formula:

[
sin(2œÄx / period)
]
[
cos(2œÄx / period)
]

### Example for hour:

```python
df['hour_sin'] = np.sin(2 * np.pi * df['hour'] / 24)
df['hour_cos'] = np.cos(2 * np.pi * df['hour'] / 24)
```

Use for:

* Hour (24)
* Month (12)
* Day of week (7)

This is critical for:

* Time series
* Neural networks
* Gradient boosting

---

# 4Ô∏è‚É£ Create Boolean Time Flags

Sometimes binary features are powerful.

Examples:

```python
df['is_weekend'] = df['day_of_week'].isin([5,6]).astype(int)
df['is_month_start'] = df['date'].dt.is_month_start.astype(int)
df['is_month_end'] = df['date'].dt.is_month_end.astype(int)
```

Other examples:

* Is holiday
* Is business hour
* Is festival season

---

# 5Ô∏è‚É£ Time Differences (Very Powerful)

Often the difference matters more than the timestamp.

Examples:

```python
df['days_since_signup'] = (today - df['signup_date']).dt.days
```

Examples in real life:

* Days since last purchase
* Time since last login
* Time between transactions
* Lag features

This captures recency effect.

---

# 6Ô∏è‚É£ Lag Features (For Time Series)

Use past values to predict future.

```python
df['sales_lag_1'] = df['sales'].shift(1)
df['sales_lag_7'] = df['sales'].shift(7)
```

Used in:

* Forecasting
* Stock prediction
* Demand prediction

---

# 7Ô∏è‚É£ Rolling / Moving Window Features

Capture trends.

```python
df['rolling_mean_7'] = df['sales'].rolling(7).mean()
df['rolling_std_7'] = df['sales'].rolling(7).std()
```

This captures:

* Momentum
* Volatility
* Short-term trends

---

# 8Ô∏è‚É£ Trend Encoding (Elapsed Time)

Sometimes you want linear time progression.

```python
df['time_index'] = (df['date'] - df['date'].min()).dt.days
```

Used in:

* Regression
* Trend modeling

---

# 9Ô∏è‚É£ Seasonality Features

Real world patterns:

* Retail spikes in December
* Food delivery spikes at night
* Traffic spikes at 9 AM

So you create:

* Month
* Weekday
* Hour
* Quarter

Or group averages:

```python
monthly_avg = df.groupby('month')['sales'].mean()
```

---

# üîü Holiday Encoding

Important in:

* E-commerce
* Finance
* Transport

Use holiday libraries or custom calendar.

Binary feature:

```
is_holiday
```

---

# üö® Common Mistakes

‚ùå Using raw timestamp number
‚ùå Not sorting time before lag
‚ùå Data leakage (using future info)
‚ùå Not handling timezone
‚ùå Ignoring cyclical nature

---

# üß† When to Use What?

| Problem Type                     | Recommended              |
| -------------------------------- | ------------------------ |
| Classification (non-time series) | Extract components       |
| Forecasting                      | Lag + Rolling + Cyclical |
| Deep learning                    | Cyclical + Trend index   |
| Tree models                      | Basic extraction enough  |
| Linear regression                | Cyclical required        |

---

# üéØ Real Industry Example

In ride-hailing apps:

Features include:

* Hour of day
* Day of week
* Is weekend
* Is holiday
* Surge hour
* Last ride time
* Rolling demand 15 min

That‚Äôs how they predict demand.

---

# üî• Final Mental Model

Raw timestamp ‚Üí
Break into components ‚Üí
Add cyclic encoding ‚Üí
Add recency features ‚Üí
Add lag/rolling (if time series) ‚Üí
Avoid leakage ‚Üí
Train model

---

If you want, I can next give:

* üöÄ Complete interview-ready explanation
* üìä End-to-end code example
* üî• Time-series specific advanced playbook
* ü§Ø Deep intuition of why sin/cos works geometrically

Tell me what level you want next.

In [31]:
import numpy as np
import pandas as pd

In [32]:
date = pd.read_csv("C:\\Users\Admin\\OneDrive\\Desktop\\DS_Resources\\ml_campus_x\\100-days-of-machine-learning\\day34-handling-date-and-time\\orders.csv")
time = pd.read_csv("C:\\Users\Admin\\OneDrive\\Desktop\\DS_Resources\\ml_campus_x\\100-days-of-machine-learning\\day34-handling-date-and-time\\messages.csv")

In [33]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [34]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           –∏—â—É –Ω–∞ —Å–µ–≥–æ–¥–Ω—è –º—É–∂–∏–∫–∞ 37
1  2014-04-29 23:40:00   –ü–ê–†–ï–ù–¨ –ë–ò –ò–©–ï–¢ –î–†–£–ì–ê –°–ï–ô–ß–ê–°!! –°–ú–° –ú–ú–° 0955532826
2  2012-12-30 00:21:00           –î–Ω–µ–ø—Ä.–º 43 –ø–æ–∑–Ω.—Å –¥/–∂ *.–æ  067.16.34.576
3  2014-11-28 00:31:00  –ö–ò–ï–í –ò–©–£ –î/–ñ –î–û 45 –ú–ù–ï –°–ï–ô–ß–ê–° –°–ö–£–ß–ù–û 093 629 9...
4  2013-10-26 23:11:00    –ó–∞—è —è —Ç–µ–±—è –Ω–∏–∫–æ–≥–¥–∞ –Ω–µ –æ–±–∏–∂—É  –ª—é–±–ª—é —Ç–µ–±—è!)  –î–∞—à–µ

In [35]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [36]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [37]:
date['date'].dtype

dtype('O')

In [38]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [39]:
date['date'].dtype

dtype('<M8[ns]')

In [40]:
date.head()

        date  product_id  city_id  orders
0 2019-12-10        5628       25       3
1 2018-08-15        3646       14     157
2 2018-10-23        1859       25       1
3 2019-08-17        7292       25       1
4 2019-01-06        4344       25       3

In [41]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### 1. Extract year

In [47]:
date['date_year'] = date['date'].dt.year

date.sample(5)

          date  product_id  city_id  orders  date_year
590 2018-08-14        3197       17      27       2018
348 2019-02-09        1848       14     135       2019
329 2019-03-05        5347        3       5       2019
124 2018-11-22        1440       16      23       2018
260 2019-02-04        4483       25       1       2019

# extracting Month

In [48]:
date['date_month_no'] = date['date'].dt.month

date.head()

        date  product_id  city_id  orders  date_year  date_month_no
0 2019-12-10        5628       25       3       2019             12
1 2018-08-15        3646       14     157       2018              8
2 2018-10-23        1859       25       1       2018             10
3 2019-08-17        7292       25       1       2019              8
4 2019-01-06        4344       25       3       2019              1

In [49]:
date['date_month_name'] = date['date'].dt.month_name()

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

#### Extract Days

In [50]:
date['date_day'] = date['date'].dt.day

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [51]:
# day of week
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [52]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [53]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

#### Extract week of the year

In [70]:
# date['date_week'] = date['date'].dt.week
# date.drop(columns=['product_id','city_id','orders']).head()

#### Extract Quarter

In [61]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

#### Extract Semester

In [63]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

#### Extract Time elapsed between dates

In [65]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2026, 2, 21, 10, 12, 44, 55081)

In [66]:
today - date['date']

0     2265 days 10:12:44.055081
1     2747 days 10:12:44.055081
2     2678 days 10:12:44.055081
3     2380 days 10:12:44.055081
4     2603 days 10:12:44.055081
                 ...
995   2693 days 10:12:44.055081
996   2634 days 10:12:44.055081
997   2482 days 10:12:44.055081
998   2547 days 10:12:44.055081
999   2321 days 10:12:44.055081
Name: date, Length: 1000, dtype: timedelta64[ns]

In [68]:
# # Months passed

# np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

In [71]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [72]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,–∏—â—É –Ω–∞ —Å–µ–≥–æ–¥–Ω—è –º—É–∂–∏–∫–∞ 37,0,50,0
1,2014-04-29 23:40:00,–ü–ê–†–ï–ù–¨ –ë–ò –ò–©–ï–¢ –î–†–£–ì–ê –°–ï–ô–ß–ê–°!! –°–ú–° –ú–ú–° 0955532826,23,40,0
2,2012-12-30 00:21:00,–î–Ω–µ–ø—Ä.–º 43 –ø–æ–∑–Ω.—Å –¥/–∂ *.–æ 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,–ö–ò–ï–í –ò–©–£ –î/–ñ –î–û 45 –ú–ù–ï –°–ï–ô–ß–ê–° –°–ö–£–ß–ù–û 093 629 9...,0,31,0
4,2013-10-26 23:11:00,–ó–∞—è —è —Ç–µ–±—è –Ω–∏–∫–æ–≥–¥–∞ –Ω–µ –æ–±–∏–∂—É –ª—é–±–ª—é —Ç–µ–±—è!) –î–∞—à–µ,23,11,0

#### Extract Time part

In [73]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,–∏—â—É –Ω–∞ —Å–µ–≥–æ–¥–Ω—è –º—É–∂–∏–∫–∞ 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,–ü–ê–†–ï–ù–¨ –ë–ò –ò–©–ï–¢ –î–†–£–ì–ê –°–ï–ô–ß–ê–°!! –°–ú–° –ú–ú–° 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,–î–Ω–µ–ø—Ä.–º 43 –ø–æ–∑–Ω.—Å –¥/–∂ *.–æ 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,–ö–ò–ï–í –ò–©–£ –î/–ñ –î–û 45 –ú–ù–ï –°–ï–ô–ß–ê–° –°–ö–£–ß–ù–û 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,–ó–∞—è —è —Ç–µ–±—è –Ω–∏–∫–æ–≥–¥–∞ –Ω–µ –æ–±–∏–∂—É –ª—é–±–ª—é —Ç–µ–±—è!) –î–∞—à–µ,23,11,0,23:11:00

#### Time difference

In [74]:
today - time['date']

0     4451 days 09:22:44.055081
1     4315 days 10:32:44.055081
2     4801 days 09:51:44.055081
3     4103 days 09:41:44.055081
4     4500 days 11:01:44.055081
                 ...
995   5090 days 09:22:44.055081
996   4411 days 10:58:44.055081
997   4876 days 10:35:44.055081
998   4992 days 10:38:44.055081
999   4264 days 10:47:44.055081
Name: date, Length: 1000, dtype: timedelta64[ns]

In [75]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.846002e+08
1      3.728540e+08
2      4.148419e+08
3      3.545341e+08
4      3.888397e+08
           ...
995    4.398098e+08
996    3.811499e+08
997    4.213245e+08
998    4.313471e+08
999    3.684485e+08
Name: date, Length: 1000, dtype: float64

In [76]:

# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6.410003e+06
1      6.214233e+06
2      6.914032e+06
3      5.908902e+06
4      6.480662e+06
           ...
995    7.330163e+06
996    6.352499e+06
997    7.022076e+06
998    7.189119e+06
999    6.140808e+06
Name: date, Length: 1000, dtype: float64

In [78]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      106833.378904
1      103570.545571
2      115233.862238
3       98481.695571
4      108011.028904
           ...
995    122169.378904
996    105874.978904
997    117034.595571
998    119818.645571
999    102346.795571
Name: date, Length: 1000, dtype: float64